Pandas
1. Series
2. DataFrame

In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\mynam\anaconda3\lib\site-packages (2.1.4)
Requirement already satisfied: numpy<2,>=1.23.2 in c:\users\mynam\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\mynam\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\mynam\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\mynam\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\mynam\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [8]:
import pandas as pd

In [14]:
data = [20,30,40,50]
ind = ["A","B","C","D"]

s_data = pd.Series(data, index = ind,dtype = 'f') 
s_data

A    20.0
B    30.0
C    40.0
D    50.0
dtype: float32

In [15]:
import numpy as np

In [18]:
data = np.random.randint(1,100,50)

s_data = pd.Series(data) 
s_data

0     67
1     83
2     97
3     51
4     45
5     99
6      3
7     68
8     27
9     68
10    97
11    85
12    51
13    42
14    97
15    58
16    34
17    68
18    69
19    76
20    73
21    64
22    23
23    85
24    82
25    54
26    47
27    33
28    64
29    51
30    91
31    13
32    39
33    35
34    12
35    25
36     1
37    44
38    19
39     9
40     9
41     4
42    64
43     7
44    79
45     4
46    12
47    35
48    84
49    44
dtype: int32

In [19]:
s_data[0]

67

In [22]:
data = np.random.randint(1,100,10)
df = pd.DataFrame(data, columns = ["Age"])
df

   Age
0   24
1   16
2   20
3   86
4   92
5   24
6   24
7   57
8   12
9   62

In [23]:
df["Income"] = np.random.randint(1000,50000,10)
df

   Age  Income
0   24   27843
1   16   25205
2   20    2719
3   86   46049
4   92   20292
5   24   12298
6   24   34058
7   57   45522
8   12    5802
9   62   43512

In [24]:
import warnings

warnings.filterwarnings('ignore')

In [27]:
df.head()

   Age  Income
0   24   27843
1   16   25205
2   20    2719
3   86   46049
4   92   20292

In [28]:
df.tail()

   Age  Income
5   24   12298
6   24   34058
7   57   45522
8   12    5802
9   62   43512

In [29]:
df.head(2)

   Age  Income
0   24   27843
1   16   25205

In [30]:
df.columns

Index(['Age', 'Income'], dtype='object')

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     10 non-null     int32
 1   Income  10 non-null     int32
dtypes: int32(2)
memory usage: 212.0 bytes

In [32]:
df.columns

Index(['Age', 'Income'], dtype='object')

In [34]:
df.columns = ["Std_Age","Std_Income"]
df

   Std_Age  Std_Income
0       24       27843
1       16       25205
2       20        2719
3       86       46049
4       92       20292
5       24       12298
6       24       34058
7       57       45522
8       12        5802
9       62       43512

In [37]:
# df[['Std_Age']]
# df.Std_Age

0    24
1    16
2    20
3    86
4    92
5    24
6    24
7    57
8    12
9    62
Name: Std_Age, dtype: int32

In [38]:
df.Std_Age.min()

12

In [39]:
df.Std_Age.max()

92

In [40]:
len(df.Std_Age)

10

In [41]:
df.Std_Age.sum()

417

In [42]:
417/10

41.7

In [43]:
df.Std_Age.mean()

41.7

In [44]:
df.describe()

         Std_Age    Std_Income
count  10.000000     10.000000
mean   41.700000  26330.000000
std    29.985367  16082.779956
min    12.000000   2719.000000
25%    21.000000  14296.500000
50%    24.000000  26524.000000
75%    60.750000  41148.500000
max    92.000000  46049.000000